app/controllers/link_controller.rb

SELECT *,count(distinct username) as c,id FROM `links` WHERE (url not in (select url from linkexcludes) AND username not in (select username from blacklists) and posted>'2009-12-15 10:29:29' and text like '%London%') GROUP BY url ORDER BY count(distinct username) desc LIMIT 100
---
  def index
    output=""
    links=Hash.new
    if params[:q]=="ZZZ"
      $q=nil
      params[:q]=nil
    end
    if $q!=nil
      output<<"Filter of #{$q} - <a href='/link?q=ZZZ'>Remove</a><br><br>"
      params[:q]=$q
    end
    if params[:q]!=nil
      output<<"Filter of #{$q} - <a href='/link?q=ZZZ'>Remove</a><br><br>"
      query="and text like '%#{params[:q]}%'"
      $q=params[:q]
    else
      query=""
      $q=nil
    end

    Link.find(:all,:select=>"*,count(distinct username) as c,id",:group => :url,:order=>"count(distinct username) desc",:limit=>100,:conditions=>"url not in (select url from linkexcludes) AND username not in (select username from blacklists) and posted>'#{(Time.now-60*60*6).strftime('%Y-%m-%d %H:%M:%S')}' #{query}").each do |l|

SELECT * FROM `links` WHERE (`links`.`id` = 2355695)
SELECT * FROM `linkexcludes` WHERE (url='http://wefollow.com') LIMIT 1
INSERT INTO `linkexcludes` (`url`) VALUES('http://wefollow.com')
---
  def remove
    url=Link.find(params[:id]).url
    le=Linkexclude.find(:first,:conditions=>"url='#{url}'")
    if le==nil
      le=Linkexclude.new
    end
    le.url=url
    le.save